098_Мастер_Ра_разработка/src/Documents/ПриходныйКассовыйОрдер/ПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходныйКассовыйОрдер</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоАктам</registerRecords>
  <registerRecords>AccumulationRegister.Касса</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоЗаказам</registerRecords>
  <attributes>
    <name>ВидПлатежа</name>
    <type>
      <types>EnumRef.ФормыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаСчет</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КодыЗаказов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентБренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПрихода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтатьиПрихода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбоснованиеПлатежа</name>
    <type>
      <types>DocumentRef.Счет</types>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьВБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДохода</name>
    <type>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статусы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.Заявка</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДохода</name>
      <type>
        <types>CatalogRef.СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтатьиПрихода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

098_Мастер_Ра_разработка/src/AccumulationRegisters/ВзаиморасчетыПоЗаказам/ВзаиморасчетыПоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыПоЗаказам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Акт</name>
    <type>
      <types>DocumentRef.Акт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

098_Мастер_Ра_разработка/src/AccumulationRegisters/ВзаиморасчетыПоАктам/ВзаиморасчетыПоАктам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыПоАктам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КодЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

098_Мастер_Ра_разработка/src/AccumulationRegisters/Касса/Касса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Касса</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйСчет</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПлатежа</name>
    <type>
      <types>EnumRef.ФормыОплат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСтатьи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

098_Мастер_Ра_разработка/src/Documents/ПриходныйКассовыйОрдер/ObjectModule.bsl
// @strict-types


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВзаиморасчетыПоЗаказам.Записывать	= Истина;
	Движения.ВзаиморасчетыПоАктам.Записывать 	= Истина;
	Движения.Касса.Записывать 					= Истина;
	
	Если  Заказы.Количество()=0 Тогда 		
		запись = Движения.ВзаиморасчетыПоЗаказам.Добавить();
		запись.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		запись.Период       = Ссылка.Дата;
		запись.Регистратор 	= Ссылка;
		запись.Организация 	= Ссылка.Организация;
		запись.Контрагент	= Ссылка.Контрагент;
		запись.Сумма     	= СуммаДокумента;
		
		// регистр Касса 
		Движение 				= Движения.Касса.Добавить();
		Движение.ВидДвижения    = ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Организация 	= Организация;
		Движение.РасчетныйСчет 	= КассаСчет;
		Движение.ВидПлатежа 	= ВидПлатежа;
		Движение.СтавкаНДС      = Контрагент.СтавкаНДС;
		Движение.Месяц 			= Период;
		Движение.Сумма 			= СуммаДокумента;
		//Если заполнено в шапке
		Если ЗначениеЗаполнено(СтатьяДохода) Тогда 
			Движение.Статья 		= СтатьяДохода;
		КонецЕсли;
		Если ЗначениеЗаполнено(НомерСтатьиПрихода) Тогда 
			Движение.НомерСтатьи 	= НомерСтатьиПрихода;
		КонецЕсли;		

	иначе	
		для Каждого стрТЧ из Заказы цикл
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВзаиморасчетыОстатки.СуммаОстаток
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыПоЗаказам.Остатки(&НаДату, КодЗаказа = &КодЗаказа) КАК ВзаиморасчетыОстатки";
			
			Запрос.УстановитьПараметр("КодЗаказа", стрТЧ.КодЗаказа);
			Запрос.УстановитьПараметр("НаДату", Ссылка.Дата-1);
			
			Результат = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			СуммаОстаток = 0;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СуммаОстаток = ВыборкаДетальныеЗаписи.СуммаОстаток;
			КонецЦикла;
			
			Если СуммаОстаток=0 Тогда 
				Сообщить("По заказу "+стрТЧ.КодЗаказа+" равно: "+СуммаОстаток);
				//Отказ = Истина;
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(Организация) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Заявка.Организация
				|ИЗ
				|	Документ.Заявка КАК Заявка
				|ГДЕ
				|	Заявка.Номер = &КодЗаказа";
				
				Запрос.УстановитьПараметр("КодЗаказа", стрТЧ.КодЗаказа);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Организация = ВыборкаДетальныеЗаписи.Организация;
				КонецЦикла;
				
				Записать();
			КонецЕсли;
			
			запись = Движения.ВзаиморасчетыПоЗаказам.Добавить();
			запись.ВидДвижения 	= ВидДвиженияНакопления.Расход;
			запись.Период       = Ссылка.Дата;
			запись.Организация  = Ссылка.Организация;
			запись.Регистратор 	= Ссылка;
			запись.Контрагент	= Ссылка.Контрагент;
			запись.КодЗаказа 	= стрТЧ.КодЗаказа;
			запись.Сумма     	= стрТЧ.Сумма;
			
			запись = Движения.ВзаиморасчетыПоАктам.Добавить();
			запись.ВидДвижения 	= ВидДвиженияНакопления.Расход;
			запись.Период       = Ссылка.Дата;
			запись.Организация  = Ссылка.Организация;
			запись.Регистратор 	= Ссылка;
			запись.Контрагент	= Ссылка.Контрагент;
			запись.КодЗаказа 	= стрТЧ.КодЗаказа;
			запись.Сумма     	= стрТЧ.Сумма;
			
			
			// регистр Касса 
			Движение 				= Движения.Касса.Добавить();
			Движение.ВидДвижения    = ВидДвиженияНакопления.Приход;
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.РасчетныйСчет 	= КассаСчет;
			Движение.ВидПлатежа 	= ВидПлатежа;
			Движение.СтавкаНДС      = Контрагент.СтавкаНДС;
			Движение.Месяц 			= Период;
			Движение.Статья 		= стрТЧ.СтатьяДохода;
			Движение.НомерСтатьи 	= стрТЧ.НомерСтатьиПрихода;
			Движение.КодЗаказа      = стрТЧ.КодЗаказа;
			Движение.Сумма 			= стрТЧ.Сумма;

		КонецЦикла;
	КонецЕсли;
	
	Движения.Записать();
	
КонецПроцедуры
